#+title: Contrast ratio values of the Doric themes
#+author: Protesilaos Stavrou (https://protesilaos.com)
#+startup: content indent

Evaluate this snippet. Then update a table by typing =C-c C-c= with
point at the =#+TBLFM:= line.

#+begin_src emacs-lisp :results output silent
;; Copied from my `modus-themes'.

;; This is the WCAG formula to measure relative luminance:
;; <https://www.w3.org/TR/WCAG20-TECHS/G18.html>.
(defun modus-themes--wcag-contribution (channel weight)
  "Return the CHANNEL contribution to overall luminance given WEIGHT."
  (* weight
     (if (<= channel 0.03928)
         (/ channel 12.92)
       (expt (/ (+ channel 0.055) 1.055) 2.4))))

(defun modus-themes-wcag-formula (hex)
  "Get WCAG value of color value HEX.
The value is defined in hexadecimal RGB notation, such #123456."
  (let ((channels (color-name-to-rgb hex))
        (weights '(0.2126 0.7152 0.0722))
        contribution)
    (while channels
      (push (modus-themes--wcag-contribution (pop channels) (pop weights)) contribution))
    (apply #'+ contribution)))

;;;###autoload
(defun modus-themes-contrast (c1 c2)
  "Measure WCAG contrast ratio between C1 and C2.
C1 and C2 are color values written in hexadecimal RGB."
  (let ((ct (/ (+ (modus-themes-wcag-formula c1) 0.05)
               (+ (modus-themes-wcag-formula c2) 0.05))))
    (max ct (/ ct))))

(defalias #'Λ #'modus-themes-contrast)
#+end_src

* Light themes
:PROPERTIES:
:CUSTOM_ID: h:light-themes
:END:

** Doric Almond
:PROPERTIES:
:CUSTOM_ID: h:doric-almond
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #fef8ed |          #efe4e6 |    #dfd9de |           #cce7b4 |   #fee1ce |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #40282e |   12.73 |            10.83 |       9.68 |             10.03 |     10.81 |
| fg-shadow-subtle  | #6a6098 |    5.31 |             4.52 |       4.04 |              4.19 |      4.51 |
| fg-neutral        | #4e4053 |    9.10 |             7.75 |       6.93 |              7.17 |      7.73 |
| fg-shadow-intense | #206038 |    7.12 |             6.06 |       5.42 |              5.61 |      6.04 |
| fg-accent         | #880058 |    9.08 |             7.73 |       6.91 |              7.16 |      7.71 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a00040 |    7.73 |             6.58 |       5.89 |              6.10 |      6.57 |
| fg-green          | #006730 |    6.66 |             5.67 |       5.07 |              5.25 |      5.66 |
| fg-yellow         | #704000 |    8.20 |             6.98 |       6.24 |              6.46 |      6.97 |
| fg-blue           | #203080 |   11.06 |             9.42 |       8.42 |              8.72 |      9.40 |
| fg-magenta        | #800060 |    9.52 |             8.10 |       7.24 |              7.50 |      8.09 |
| fg-cyan           | #005560 |    8.05 |             6.85 |       6.12 |              6.34 |      6.84 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Beach
:PROPERTIES:
:CUSTOM_ID: h:doric-beach
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #eae3d8 |          #ded4c0 |    #d4c2ab |           #abd2c9 |   #efd0a9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #213937 |    9.66 |             8.38 |       7.10 |              7.50 |      8.37 |
| fg-shadow-subtle  | #605d48 |    5.22 |             4.53 |       3.83 |              4.05 |      4.52 |
| fg-neutral        | #504533 |    7.36 |             6.38 |       5.40 |              5.71 |      6.37 |
| fg-shadow-intense | #045e53 |    6.03 |             5.23 |       4.43 |              4.68 |      5.22 |
| fg-accent         | #834328 |    5.89 |             5.10 |       4.33 |              4.57 |      5.10 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #902000 |    6.89 |             5.97 |       5.06 |              5.35 |      5.96 |
| fg-green          | #006000 |    6.16 |             5.34 |       4.53 |              4.79 |      5.34 |
| fg-yellow         | #595000 |    6.41 |             5.55 |       4.71 |              4.97 |      5.55 |
| fg-blue           | #103077 |    9.63 |             8.35 |       7.07 |              7.48 |      8.34 |
| fg-magenta        | #700054 |    9.07 |             7.86 |       6.66 |              7.04 |      7.85 |
| fg-cyan           | #005460 |    6.76 |             5.86 |       4.97 |              5.25 |      5.85 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Cherry
:PROPERTIES:
:CUSTOM_ID: h:doric-cherry
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f7edf1 |          #e5dde0 |    #d7c9d0 |           #cc95b7 |   #edcae5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #35292f |   12.15 |            10.43 |       8.71 |              5.66 |      9.39 |
| fg-shadow-subtle  | #675462 |    6.07 |             5.21 |       4.35 |              2.83 |      4.69 |
| fg-neutral        | #4e4053 |    8.40 |             7.22 |       6.03 |              3.92 |      6.50 |
| fg-shadow-intense | #683455 |    8.29 |             7.12 |       5.95 |              3.87 |      6.41 |
| fg-accent         | #77266e |    8.02 |             6.89 |       5.75 |              3.74 |      6.20 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a00040 |    7.14 |             6.13 |       5.12 |              3.33 |      5.52 |
| fg-green          | #006730 |    6.15 |             5.28 |       4.41 |              2.87 |      4.75 |
| fg-yellow         | #704000 |    7.57 |             6.50 |       5.43 |              3.53 |      5.85 |
| fg-blue           | #203080 |   10.21 |             8.77 |       7.32 |              4.76 |      7.90 |
| fg-magenta        | #800060 |    8.79 |             7.55 |       6.30 |              4.10 |      6.80 |
| fg-cyan           | #005560 |    7.43 |             6.38 |       5.33 |              3.46 |      5.75 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Coral
:PROPERTIES:
:CUSTOM_ID: h:doric-coral
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #fcf0e5 |          #efe4db |    #e6d5d0 |           #fcb894 |   #c8f0e3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #40282e |   12.00 |            10.76 |       9.48 |              7.96 |     10.91 |
| fg-shadow-subtle  | #8f5854 |    5.07 |             4.55 |       4.01 |              3.36 |      4.61 |
| fg-neutral        | #514250 |    8.35 |             7.48 |       6.59 |              5.53 |      7.59 |
| fg-shadow-intense | #a02016 |    6.91 |             6.19 |       5.45 |              4.58 |      6.28 |
| fg-accent         | #085078 |    7.71 |             6.91 |       6.09 |              5.11 |      7.01 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a02610 |    6.74 |             6.04 |       5.32 |              4.47 |      6.13 |
| fg-green          | #006940 |    6.05 |             5.43 |       4.78 |              4.01 |      5.50 |
| fg-yellow         | #753800 |    8.07 |             7.23 |       6.37 |              5.35 |      7.33 |
| fg-blue           | #183182 |   10.41 |             9.33 |       8.22 |              6.90 |      9.46 |
| fg-magenta        | #820145 |    9.19 |             8.23 |       7.25 |              6.09 |      8.35 |
| fg-cyan           | #025763 |    7.36 |             6.59 |       5.81 |              4.88 |      6.69 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Earth
:PROPERTIES:
:CUSTOM_ID: h:doric-earth
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #f0eddf |          #dfdfce |    #d1ceb6 |           #c09fa0 |   #e7d5b9 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #30232e |   12.72 |            11.09 |       9.40 |              6.20 |     10.40 |
| fg-shadow-subtle  | #635650 |    6.01 |             5.23 |       4.44 |              2.92 |      4.91 |
| fg-neutral        | #504033 |    8.43 |             7.34 |       6.23 |              4.10 |      6.89 |
| fg-shadow-intense | #58383f |    8.71 |             7.59 |       6.44 |              4.24 |      7.12 |
| fg-accent         | #74321f |    8.06 |             7.02 |       5.96 |              3.93 |      6.59 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a03000 |    6.13 |             5.34 |       4.53 |              2.98 |      5.01 |
| fg-green          | #206700 |    5.96 |             5.19 |       4.40 |              2.90 |      4.87 |
| fg-yellow         | #705200 |    6.18 |             5.38 |       4.56 |              3.01 |      5.05 |
| fg-blue           | #103060 |   11.08 |             9.66 |       8.19 |              5.40 |      9.06 |
| fg-magenta        | #690f44 |   10.21 |             8.89 |       7.54 |              4.97 |      8.34 |
| fg-cyan           | #105f66 |    6.27 |             5.47 |       4.64 |              3.05 |      5.13 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Jade
:PROPERTIES:
:CUSTOM_ID: h:doric-jade
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e2f0c9 |          #d5e1c0 |    #c2ceb9 |           #74d98f |   #cfe2d4 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #25311f |   11.41 |             9.99 |       8.34 |              7.85 |     10.07 |
| fg-shadow-subtle  | #6b5a77 |    5.23 |             4.58 |       3.82 |              3.60 |      4.62 |
| fg-neutral        | #605258 |    6.17 |             5.40 |       4.51 |              4.24 |      5.44 |
| fg-shadow-intense | #006000 |    6.56 |             5.75 |       4.80 |              4.51 |      5.79 |
| fg-accent         | #106870 |    5.42 |             4.75 |       3.96 |              3.73 |      4.78 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #990020 |    7.38 |             6.47 |       5.40 |              5.08 |      6.52 |
| fg-green          | #006710 |    5.95 |             5.21 |       4.35 |              4.09 |      5.25 |
| fg-yellow         | #706000 |    5.22 |             4.57 |       3.81 |              3.59 |      4.60 |
| fg-blue           | #003370 |   10.27 |             9.00 |       7.51 |              7.07 |      9.07 |
| fg-magenta        | #782050 |    8.27 |             7.24 |       6.05 |              5.69 |      7.30 |
| fg-cyan           | #006070 |    6.03 |             5.28 |       4.41 |              4.15 |      5.33 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Light
:PROPERTIES:
:CUSTOM_ID: h:doric-light
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ffffff |          #efeff2 |    #dbdce1 |           #a0bcd0 |   #d8f1f3 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000000 |   21.00 |            18.30 |      15.34 |             10.60 |     17.80 |
| fg-shadow-subtle  | #5a6268 |    6.21 |             5.41 |       4.54 |              3.13 |      5.26 |
| fg-neutral        | #424d53 |    8.68 |             7.57 |       6.34 |              4.38 |      7.36 |
| fg-shadow-intense | #213067 |   12.48 |            10.87 |       9.11 |              6.30 |     10.57 |
| fg-accent         | #084092 |    9.73 |             8.48 |       7.10 |              4.91 |      8.24 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a01010 |    8.15 |             7.10 |       5.95 |              4.11 |      6.91 |
| fg-green          | #106710 |    7.07 |             6.16 |       5.16 |              3.57 |      5.99 |
| fg-yellow         | #60400f |    9.38 |             8.18 |       6.85 |              4.74 |      7.95 |
| fg-blue           | #103077 |   12.27 |            10.69 |       8.96 |              6.19 |     10.40 |
| fg-magenta        | #700d50 |   11.28 |             9.83 |       8.24 |              5.69 |      9.56 |
| fg-cyan           | #005355 |    8.87 |             7.73 |       6.48 |              4.47 |      7.51 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Marble
:PROPERTIES:
:CUSTOM_ID: h:doric-marble
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #ededed |          #dfdfdf |    #cdcdcd |           #b0b0b0 |   #e5d7c5 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #202020 |   13.92 |            12.23 |      10.25 |              7.51 |     11.53 |
| fg-shadow-subtle  | #595959 |    5.98 |             5.26 |       4.41 |              3.23 |      4.96 |
| fg-neutral        | #4a4a4a |    7.57 |             6.65 |       5.57 |              4.09 |      6.27 |
| fg-shadow-intense | #404040 |    8.86 |             7.78 |       6.52 |              4.78 |      7.34 |
| fg-accent         | #603d3a |    8.06 |             7.08 |       5.93 |              4.35 |      6.67 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a01010 |    6.96 |             6.12 |       5.13 |              3.76 |      5.77 |
| fg-green          | #106710 |    6.04 |             5.31 |       4.45 |              3.26 |      5.00 |
| fg-yellow         | #60400f |    8.02 |             7.04 |       5.90 |              4.33 |      6.64 |
| fg-blue           | #103077 |   10.48 |             9.21 |       7.72 |              5.66 |      8.68 |
| fg-magenta        | #700d50 |    9.63 |             8.46 |       7.09 |              5.20 |      7.98 |
| fg-cyan           | #005355 |    7.57 |             6.65 |       5.58 |              4.09 |      6.27 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Oak
:PROPERTIES:
:CUSTOM_ID: h:doric-oak
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e0d8c7 |          #d5c9b5 |    #c2b19e |           #b1bf88 |   #b7d2b7 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #3a2018 |   10.59 |             9.18 |       7.20 |              7.63 |      9.23 |
| fg-shadow-subtle  | #6b5225 |    5.18 |             4.50 |       3.52 |              3.73 |      4.52 |
| fg-neutral        | #53402f |    6.92 |             6.00 |       4.70 |              4.98 |      6.03 |
| fg-shadow-intense | #3f5000 |    6.28 |             5.45 |       4.27 |              4.53 |      5.48 |
| fg-accent         | #0f5720 |    6.16 |             5.34 |       4.19 |              4.44 |      5.37 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #982500 |    5.70 |             4.94 |       3.88 |              4.11 |      4.97 |
| fg-green          | #226700 |    4.93 |             4.27 |       3.35 |              3.55 |      4.29 |
| fg-yellow         | #595000 |    5.76 |             5.00 |       3.92 |              4.15 |      5.02 |
| fg-blue           | #103077 |    8.66 |             7.51 |       5.89 |              6.24 |      7.55 |
| fg-magenta        | #700054 |    8.15 |             7.07 |       5.55 |              5.88 |      7.11 |
| fg-cyan           | #005460 |    6.08 |             5.27 |       4.13 |              4.38 |      5.30 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Siren
:PROPERTIES:
:CUSTOM_ID: h:doric-siren
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #d9e0ed |          #c2d1df |    #b0c0cd |           #90b0e0 |   #dfc1d2 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #001020 |   14.46 |            12.31 |      10.29 |              8.65 |     11.59 |
| fg-shadow-subtle  | #3f5569 |    5.83 |             4.97 |       4.15 |              3.49 |      4.68 |
| fg-neutral        | #3a434a |    7.61 |             6.48 |       5.41 |              4.55 |      6.10 |
| fg-shadow-intense | #00498b |    6.81 |             5.80 |       4.84 |              4.07 |      5.46 |
| fg-accent         | #0f5720 |    6.59 |             5.61 |       4.69 |              3.94 |      5.28 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #a01010 |    6.15 |             5.23 |       4.37 |              3.68 |      4.93 |
| fg-green          | #106710 |    5.33 |             4.54 |       3.79 |              3.19 |      4.28 |
| fg-yellow         | #60400f |    7.08 |             6.02 |       5.04 |              4.23 |      5.67 |
| fg-blue           | #103077 |    9.25 |             7.88 |       6.58 |              5.54 |      7.42 |
| fg-magenta        | #700d50 |    8.50 |             7.24 |       6.05 |              5.09 |      6.82 |
| fg-cyan           | #005355 |    6.69 |             5.69 |       4.76 |              4.00 |      5.36 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Wind
:PROPERTIES:
:CUSTOM_ID: h:doric-wind
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #e8f0e9 |          #d5e1d9 |    #c2ced0 |           #94c2bf |   #c9e0ba |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #000f0f |   16.81 |            14.51 |      12.12 |              9.98 |     13.82 |
| fg-shadow-subtle  | #565962 |    6.02 |             5.20 |       4.34 |              3.57 |      4.95 |
| fg-neutral        | #404248 |    8.64 |             7.46 |       6.23 |              5.13 |      7.10 |
| fg-shadow-intense | #104038 |    9.97 |             8.61 |       7.19 |              5.92 |      8.20 |
| fg-accent         | #2f6920 |    5.71 |             4.93 |       4.12 |              3.39 |      4.70 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #990020 |    7.61 |             6.57 |       5.49 |              4.52 |      6.25 |
| fg-green          | #006740 |    6.00 |             5.18 |       4.32 |              3.56 |      4.93 |
| fg-yellow         | #706000 |    5.38 |             4.64 |       3.88 |              3.19 |      4.42 |
| fg-blue           | #003370 |   10.58 |             9.14 |       7.63 |              6.28 |      8.70 |
| fg-magenta        | #782050 |    8.52 |             7.36 |       6.14 |              5.06 |      7.00 |
| fg-cyan           | #006070 |    6.22 |             5.37 |       4.48 |              3.69 |      5.11 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

* Dark themes
:PROPERTIES:
:CUSTOM_ID: h:dark-themes
:END:

** Doric Copper
:PROPERTIES:
:CUSTOM_ID: h:doric-copper
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #44312e |          #584040 |    #654f52 |           #7e462c |   #634047 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7d0bf |    8.22 |             6.38 |       5.07 |              5.06 |      6.02 |
| fg-shadow-subtle  | #9aa3af |    4.77 |             3.70 |       2.95 |              2.94 |      3.50 |
| fg-neutral        | #d0cfc8 |    7.79 |             6.05 |       4.81 |              4.80 |      5.71 |
| fg-shadow-intense | #e2a077 |    5.53 |             4.29 |       3.41 |              3.40 |      4.05 |
| fg-accent         | #d29cb7 |    5.32 |             4.13 |       3.29 |              3.28 |      3.90 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    5.87 |             4.56 |       3.63 |              3.62 |      4.30 |
| fg-green          | #b9d0aa |    7.34 |             5.70 |       4.53 |              4.52 |      5.38 |
| fg-yellow         | #c0b060 |    5.58 |             4.33 |       3.44 |              3.44 |      4.09 |
| fg-blue           | #9fbfe7 |    6.43 |             4.99 |       3.97 |              3.96 |      4.71 |
| fg-magenta        | #e9acbf |    6.45 |             5.00 |       3.98 |              3.97 |      4.72 |
| fg-cyan           | #a0c0d0 |    6.35 |             4.93 |       3.92 |              3.91 |      4.65 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Dark
:PROPERTIES:
:CUSTOM_ID: h:doric-dark
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #000000 |          #332d38 |    #43404c |           #50447f |   #521e40 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #ffffff |   21.00 |            13.35 |      10.11 |              8.49 |     12.97 |
| fg-shadow-subtle  | #a2a0b2 |    8.21 |             5.22 |       3.95 |              3.32 |      5.07 |
| fg-neutral        | #c5c7d4 |   12.49 |             7.94 |       6.02 |              5.05 |      7.72 |
| fg-shadow-intense | #cfcff8 |   13.93 |             8.86 |       6.71 |              5.63 |      8.61 |
| fg-accent         | #cda4df |    9.97 |             6.34 |       4.80 |              4.03 |      6.16 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |   10.13 |             6.44 |       4.88 |              4.09 |      6.26 |
| fg-green          | #b9d0aa |   12.67 |             8.05 |       6.10 |              5.12 |      7.83 |
| fg-yellow         | #c0b080 |    9.76 |             6.21 |       4.70 |              3.95 |      6.03 |
| fg-blue           | #9fbfe7 |   11.08 |             7.04 |       5.34 |              4.48 |      6.85 |
| fg-magenta        | #e9acbf |   11.12 |             7.07 |       5.35 |              4.49 |      6.87 |
| fg-cyan           | #a0c0d0 |   10.95 |             6.96 |       5.27 |              4.42 |      6.76 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Fire
:PROPERTIES:
:CUSTOM_ID: h:doric-fire
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #282420 |          #40332f |    #4f4542 |           #7c362c |   #56452f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #f5ceb0 |   10.52 |             8.28 |       6.34 |              5.92 |      6.27 |
| fg-shadow-subtle  | #afa497 |    6.29 |             4.95 |       3.79 |              3.54 |      3.75 |
| fg-neutral        | #d9cfbe |    9.99 |             7.86 |       6.02 |              5.63 |      5.95 |
| fg-shadow-intense | #f3ac6f |    8.02 |             6.32 |       4.84 |              4.52 |      4.78 |
| fg-accent         | #d6b577 |    7.87 |             6.20 |       4.75 |              4.43 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca27f |    7.43 |             5.85 |       4.48 |              4.18 |      4.43 |
| fg-green          | #b9d08a |    9.29 |             7.31 |       5.60 |              5.23 |      5.54 |
| fg-yellow         | #c0b080 |    7.16 |             5.64 |       4.32 |              4.03 |      4.27 |
| fg-blue           | #9fbfe7 |    8.13 |             6.40 |       4.90 |              4.58 |      4.84 |
| fg-magenta        | #e9acbf |    8.15 |             6.42 |       4.91 |              4.59 |      4.86 |
| fg-cyan           | #a0c0d0 |    8.03 |             6.32 |       4.84 |              4.52 |      4.78 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Magma
:PROPERTIES:
:CUSTOM_ID: h:doric-magma
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #351b10 |          #48332b |    #5f4743 |           #7c301c |   #5a2914 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e0baa0 |    8.89 |             6.56 |       4.74 |              5.09 |      6.64 |
| fg-shadow-subtle  | #a0a1a6 |    6.19 |             4.56 |       3.30 |              3.55 |      4.62 |
| fg-neutral        | #cfbbb0 |    8.66 |             6.38 |       4.61 |              4.96 |      6.46 |
| fg-shadow-intense | #ff9d7e |    7.89 |             5.82 |       4.20 |              4.52 |      5.89 |
| fg-accent         | #f65f47 |    5.05 |             3.73 |       2.69 |              2.89 |      3.77 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #fc826f |    6.51 |             4.80 |       3.47 |              3.73 |      4.86 |
| fg-green          | #b9c06a |    8.22 |             6.06 |       4.38 |              4.71 |      6.14 |
| fg-yellow         | #cfa030 |    6.63 |             4.89 |       3.53 |              3.80 |      4.95 |
| fg-blue           | #7fafc7 |    6.73 |             4.97 |       3.59 |              3.86 |      5.03 |
| fg-magenta        | #df70af |    5.38 |             3.97 |       2.87 |              3.08 |      4.01 |
| fg-cyan           | #70a0c0 |    5.68 |             4.19 |       3.03 |              3.26 |      4.24 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Mermaid
:PROPERTIES:
:CUSTOM_ID: h:doric-mermaid
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a2f48 |          #3c3e55 |    #4c4f67 |           #424381 |   #573f5d |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #dde0f8 |   10.07 |             8.00 |       6.14 |              6.84 |      7.08 |
| fg-shadow-subtle  | #aea7c3 |    5.70 |             4.53 |       3.48 |              3.88 |      4.01 |
| fg-neutral        | #d8d0e6 |    8.81 |             7.00 |       5.37 |              5.99 |      6.19 |
| fg-shadow-intense | #c4abfe |    6.63 |             5.27 |       4.04 |              4.51 |      4.66 |
| fg-accent         | #e8add2 |    7.09 |             5.63 |       4.33 |              4.82 |      4.99 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    6.34 |             5.03 |       3.86 |              4.31 |      4.45 |
| fg-green          | #a0d0ba |    7.65 |             6.08 |       4.66 |              5.20 |      5.38 |
| fg-yellow         | #c0b080 |    6.11 |             4.85 |       3.72 |              4.15 |      4.29 |
| fg-blue           | #9fbfe7 |    6.93 |             5.51 |       4.23 |              4.71 |      4.87 |
| fg-magenta        | #e9acbf |    6.95 |             5.52 |       4.24 |              4.73 |      4.89 |
| fg-cyan           | #a0c0d0 |    6.85 |             5.44 |       4.18 |              4.65 |      4.81 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Obsidian
:PROPERTIES:
:CUSTOM_ID: h:doric-obsidian
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #181818 |          #2f2f2f |    #3a3a3a |           #505050 |   #432f2a |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e7e7e7 |   14.36 |            10.83 |       9.20 |              6.52 |     10.12 |
| fg-shadow-subtle  | #969696 |    6.00 |             4.53 |       3.85 |              2.73 |      4.23 |
| fg-neutral        | #bcbcbc |    9.35 |             7.05 |       5.99 |              4.25 |      6.59 |
| fg-shadow-intense | #b0b0b0 |    8.19 |             6.17 |       5.24 |              3.72 |      5.77 |
| fg-accent         | #b59487 |    6.38 |             4.81 |       4.09 |              2.90 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    8.57 |             6.46 |       5.49 |              3.89 |      6.04 |
| fg-green          | #b9d0aa |   10.71 |             8.07 |       6.86 |              4.86 |      7.54 |
| fg-yellow         | #c0b080 |    8.26 |             6.22 |       5.29 |              3.75 |      5.82 |
| fg-blue           | #9fbfe7 |    9.37 |             7.06 |       6.00 |              4.25 |      6.60 |
| fg-magenta        | #e9acbf |    9.40 |             7.09 |       6.02 |              4.27 |      6.62 |
| fg-cyan           | #a0c0d0 |    9.25 |             6.98 |       5.93 |              4.20 |      6.52 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Pine
:PROPERTIES:
:CUSTOM_ID: h:doric-pine
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #303f2d |          #40503d |    #575f4b |           #70523a |   #305d42 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #d0e2c8 |    8.21 |             6.33 |       4.90 |              5.21 |      5.56 |
| fg-shadow-subtle  | #bcbeaf |    5.93 |             4.57 |       3.54 |              3.76 |      4.02 |
| fg-neutral        | #cdd9be |    7.61 |             5.86 |       4.54 |              4.82 |      5.15 |
| fg-shadow-intense | #c8b399 |    5.53 |             4.26 |       3.30 |              3.50 |      3.74 |
| fg-accent         | #b0d593 |    6.82 |             5.26 |       4.07 |              4.32 |      4.62 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #e8a28f |    5.33 |             4.11 |       3.18 |              3.38 |      3.61 |
| fg-green          | #82cc9f |    5.91 |             4.56 |       3.53 |              3.75 |      4.00 |
| fg-yellow         | #c4b980 |    5.65 |             4.36 |       3.37 |              3.58 |      3.83 |
| fg-blue           | #8fbae5 |    5.51 |             4.24 |       3.28 |              3.49 |      3.73 |
| fg-magenta        | #e9acbf |    5.93 |             4.57 |       3.54 |              3.76 |      4.01 |
| fg-cyan           | #a0c0d0 |    5.84 |             4.50 |       3.48 |              3.70 |      3.95 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Plum
:PROPERTIES:
:CUSTOM_ID: h:doric-plum
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #221832 |          #302f3c |    #423b53 |           #5e4170 |   #501e3e |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e2d7e7 |   12.14 |             9.46 |       7.62 |              6.13 |      9.46 |
| fg-shadow-subtle  | #a694b1 |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
| fg-neutral        | #c6c1d3 |    9.62 |             7.49 |       6.04 |              4.85 |      7.50 |
| fg-shadow-intense | #cea6d0 |    8.03 |             6.25 |       5.04 |              4.05 |      6.26 |
| fg-accent         | #c586ba |    6.02 |             4.69 |       3.78 |              3.04 |      4.69 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    8.14 |             6.34 |       5.11 |              4.11 |      6.35 |
| fg-green          | #b9d0aa |   10.18 |             7.93 |       6.39 |              5.14 |      7.93 |
| fg-yellow         | #c0b080 |    7.84 |             6.11 |       4.93 |              3.96 |      6.12 |
| fg-blue           | #9fbfe7 |    8.90 |             6.94 |       5.59 |              4.49 |      6.94 |
| fg-magenta        | #e9acbf |    8.93 |             6.96 |       5.61 |              4.51 |      6.96 |
| fg-cyan           | #a0c0d0 |    8.79 |             6.85 |       5.52 |              4.44 |      6.86 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Valley
:PROPERTIES:
:CUSTOM_ID: h:doric-valley
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #383035 |          #484040 |    #554f52 |           #3d5e57 |   #714d4c |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #e0d5b7 |    8.75 |             6.90 |       5.47 |              4.89 |      5.01 |
| fg-shadow-subtle  | #afa497 |    5.22 |             4.12 |       3.27 |              2.92 |      2.99 |
| fg-neutral        | #d9cfbe |    8.29 |             6.54 |       5.19 |              4.64 |      4.75 |
| fg-shadow-intense | #99dec7 |    8.30 |             6.54 |       5.19 |              4.64 |      4.75 |
| fg-accent         | #f6c097 |    7.86 |             6.20 |       4.91 |              4.39 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #f6c097 |    7.86 |             6.20 |       4.91 |              4.39 |      4.50 |
| fg-green          | #b9d0aa |    7.71 |             6.08 |       4.82 |              4.31 |      4.42 |
| fg-yellow         | #c0b060 |    5.86 |             4.62 |       3.66 |              3.28 |      3.35 |
| fg-blue           | #9fbfe7 |    6.75 |             5.32 |       4.22 |              3.77 |      3.86 |
| fg-magenta        | #e9acbf |    6.77 |             5.34 |       4.23 |              3.79 |      3.88 |
| fg-cyan           | #a0c0d0 |    6.66 |             5.25 |       4.17 |              3.73 |      3.82 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Walnut
:PROPERTIES:
:CUSTOM_ID: h:doric-walnut
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #153227 |          #303931 |    #3d4543 |           #0c512c |   #42342f |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #b9d3b0 |    8.57 |             7.41 |       6.10 |              5.84 |      7.37 |
| fg-shadow-subtle  | #a09f9b |    5.22 |             4.52 |       3.72 |              3.56 |      4.49 |
| fg-neutral        | #afc2be |    7.44 |             6.43 |       5.30 |              5.06 |      6.40 |
| fg-shadow-intense | #63c789 |    6.63 |             5.73 |       4.72 |              4.51 |      5.70 |
| fg-accent         | #aea084 |    5.38 |             4.65 |       3.83 |              3.66 |      4.63 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #e8a27f |    6.53 |             5.64 |       4.65 |              4.44 |      5.62 |
| fg-green          | #82cc7f |    7.18 |             6.21 |       5.11 |              4.89 |      6.18 |
| fg-yellow         | #c4b980 |    6.98 |             6.04 |       4.97 |              4.75 |      6.01 |
| fg-blue           | #8fbae5 |    6.80 |             5.88 |       4.84 |              4.63 |      5.85 |
| fg-magenta        | #8fbae5 |    6.80 |             5.88 |       4.84 |              4.63 |      5.85 |
| fg-cyan           | #e9acbf |    7.33 |             6.33 |       5.22 |              4.99 |      6.30 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f

** Doric Water
:PROPERTIES:
:CUSTOM_ID: h:doric-water
:END:

|                   |         | bg-main | bg-shadow-subtle | bg-neutral | bg-shadow-intense | bg-accent |
| Name              |         | #2a283d |          #3a3c4c |    #4a4a5f |           #496278 |   #403f75 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-main           | #edf0f8 |   12.54 |             9.54 |       7.56 |              5.58 |      8.43 |
| fg-shadow-subtle  | #aea6b8 |    6.09 |             4.63 |       3.67 |              2.71 |      4.09 |
| fg-neutral        | #d4d9dc |   10.04 |             7.64 |       6.06 |              4.47 |      6.75 |
| fg-shadow-intense | #c0ddf2 |   10.12 |             7.70 |       6.10 |              4.50 |      6.80 |
| fg-accent         | #adade0 |    6.69 |             5.09 |       4.04 |              2.98 |      4.50 |
|-------------------+---------+---------+------------------+------------+-------------------+-----------|
| fg-red            | #eca28f |    6.90 |             5.25 |       4.16 |              3.07 |      4.63 |
| fg-green          | #a0d0ba |    8.32 |             6.33 |       5.02 |              3.70 |      5.59 |
| fg-yellow         | #c0b080 |    6.64 |             5.06 |       4.01 |              2.96 |      4.47 |
| fg-blue           | #9fbfe7 |    7.54 |             5.74 |       4.55 |              3.36 |      5.07 |
| fg-magenta        | #e9acbf |    7.57 |             5.76 |       4.56 |              3.37 |      5.09 |
| fg-cyan           | #a0c0d0 |    7.45 |             5.67 |       4.49 |              3.32 |      5.01 |
#+TBLFM: $3='(Λ $2 @2$3);%.2f :: $4='(Λ $2 @2$4);%.2f :: $5='(Λ $2 @2$5);%.2f :: $6='(Λ $2 @2$6);%.2f :: $7='(Λ $2 @2$7);%.2f
